# RbsElecPanelFeedThruLugsCurrentPhasea Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecPanelFeedThruLugsCurrentPhasea Property
ParameterTypeId Class See Also
---
"Feed Through Lugs Current Phase A"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecPanelFeedThruLugsCurrentPhasea { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecPanelFeedThruLugsCurrentPhasea As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecPanelFeedThruLugsCurrentPhasea {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace